<details><summary>Show Plan</summary>
```

data.assert_test.workspace: Reading...
module.database_cluster.random_id.snapshot_identifier[0]: Refreshing state... [id=g8r2jg]
module.database_cluster.random_password.master_password[0]: Refreshing state... [id=none]
data.assert_test.workspace: Read complete after 0s
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/511c1c1e-eace-4166-b7c1-9bbfc82c70f6]
module.database_cluster.data.aws_partition.current: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-push_logs]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cf37ffc0ce81b1aa]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-9d5a7caf-e591-4fc3-9b8b-395ecc554a78]
module.tenant_database_cluster.data.aws_partition.current: Reading...
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03d2024cd76f87de7]
module.tenant_database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.database_cluster.data.aws_partition.current: Read complete after 1s [id=aws]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.tenant_database_cluster.data.aws_partition.current: Read complete after 1s [id=aws]
module.database_cluster.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 1s [id=1813475199]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 1s [id=320642683]
data.aws_ecr_repository.repository: Reading...
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-push-ecs-task-execution-role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-push]
data.aws_ecr_repository.repository: Read complete after 0s [id=echo-server]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z04987691W18X63LDNXVM]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z04987691W18X63LDNXVM__9407f2eddc416d7cd8c8ee599f0a5c6a.staging.echo.walletconnect.com._CNAME]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310626000000005]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310513400000004]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310106100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-push-ecs-task-execution-role-20221013192310311900000003]
module.database_cluster.aws_security_group.this[0]: Refreshing state... [id=sg-0e16ed5ca4c08ad1f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020d4227523193719]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-030e538b0cb0a6d8e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0481f853db59b18ab]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096e43f33feb7bad8]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-push-target-group/4e313fa6a28675a6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01b56529aabb62ca4]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-09a393bfda92ce73c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0237d5132685aec74]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00c3da4dd2356a722]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dabd56e1ee9f13d5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-070f71778957ad172]
module.database_cluster.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-804588316]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01b56529aabb62ca41080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-089e0e3b3a4cf63c2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07621fa7fde207073]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4d707d2387daf8d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0210fd7627e6a6303]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0204db9e1b9eeeade]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-push-load-balancer/aea5ef9d0a34453a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00ddd51caea6541c4]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e6492222243f584]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061e6ac209de357b8]
module.database_cluster.aws_db_subnet_group.this[0]: Refreshing state... [id=staging-push-database]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-070f71778957ad1721080289494]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/171b42a3340fa814]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z04987691W18X63LDNXVM_staging.echo.walletconnect.com_A]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-push-load-balancer/aea5ef9d0a34453a/b671fd955200d192]
module.database_cluster.aws_rds_cluster.this[0]: Refreshing state... [id=staging-push-database]
module.database_cluster.aws_rds_cluster_instance.this["1"]: Refreshing state... [id=staging-push-database-1]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-push]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-push/staging-push-service"
        name                               = "staging-push-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:9" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-push:9" -> (known after apply)
      ~ container_definitions    = (sensitive) -> (sensitive) # forces replacement
      ~ id                       = "staging-push" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 9 -> (known after apply)
      - tags                     = {} -> null
      - task_role_arn            = "" -> null
        # (8 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.tenant_database_cluster.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "For Aurora cluster staging-push-tenant-database"
      + id                      = (known after apply)
      + name                    = "staging-push-tenant-database"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-00c3da4dd2356a722",
          + "subnet-0237d5132685aec74",
          + "subnet-0dabd56e1ee9f13d5",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.tenant_database_cluster.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = true
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backtrack_window                = 0
      + backup_retention_period         = 7
      + cluster_identifier              = "staging-push-tenant-database"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "postgres"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "staging-push-tenant-database"
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "13.6"
      + engine_version_actual           = (known after apply)
      + final_snapshot_identifier       = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "root"
      + network_type                    = (known after apply)
      + port                            = 5432
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags_all                        = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_security_group_ids          = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + timeouts {}
    }

  # module.tenant_database_cluster.aws_rds_cluster_instance.this["1"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "staging-push-tenant-database"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging-push-tenant-database-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "push"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.tenant_database_cluster.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora staging-push-tenant-database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "staging-push-tenant-database-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-push-tenant-database"
        }
      + tags_all               = {
          + "Application"      = "push"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "staging-push-tenant-database"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-03d2024cd76f87de7"
    }

  # module.tenant_database_cluster.aws_security_group_rule.cidr_ingress[0] will be created
  + resource "aws_security_group_rule" "cidr_ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "From allowed CIDRs"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.tenant_database_cluster.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "staging-push-tenant-database"
        }
    }

  # module.tenant_database_cluster.random_password.master_password[0] will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 8 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```
</details>
*Action: `pull_request`*